УТ_для_edt/src/Documents/CRM_ОтчетОРаботе/CRM_ОтчетОРаботе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_ОтчетОРаботе</name>
  <comment>Не переносить в спарку с УНФ, анализировать изменения, нужные переносить в документ УчетВремени</comment>
  <registerRecords>AccumulationRegister.CRM_РабочееВремя</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресХранилищаФайлов</name>
    <comment>Служебный реквизит, используется для механизма шаблонов</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.CRM_ШаблоныОбъектов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтрокиОтчета</name>
    <attributes>
      <name>ДатаР</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.CRM_ЭтапыПроектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Часов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеРабот</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Documents/CRM_ОтчетОРаботе/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//   Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтрокиОтчета.ДатаР					КАК Период,
	|	СтрокиОтчета.Ссылка					КАК Регистратор,
	|	
	|	СтрокиОтчета.Ссылка.Сотрудник		КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА СтрокиОтчета.ПодразделениеРабот = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) ТОГДА СтрокиОтчета.Ссылка.Подразделение
	|		ИНАЧЕ СтрокиОтчета.ПодразделениеРабот
	|	КОНЕЦ								КАК ПодразделениеРабот,
	|	СтрокиОтчета.Проект					КАК Проект,
	|	СтрокиОтчета.Этап					КАК Этап,
	|	СтрокиОтчета.ДатаР					КАК ДатаРабот,
	|	СУММА(СтрокиОтчета.Часов)			КАК Часов
	|ИЗ
	|	Документ.CRM_ОтчетОРаботе.СтрокиОтчета КАК СтрокиОтчета
	|ГДЕ
	|	СтрокиОтчета.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	СтрокиОтчета.Ссылка,
	|	ВЫБОР
	|		КОГДА СтрокиОтчета.ПодразделениеРабот = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) ТОГДА СтрокиОтчета.Ссылка.Подразделение
	|		ИНАЧЕ СтрокиОтчета.ПодразделениеРабот
	|	КОНЕЦ,
	|	СтрокиОтчета.Проект,
	|	СтрокиОтчета.Этап,
	|	СтрокиОтчета.ДатаР
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРабочееВремя", Запрос.Выполнить().Выгрузить());
КонецПроцедуры

#КонецОбласти

#КонецЕсли
